Autodesk.Revit.DB.BoundingBoxContainsPointFilter.Tolerance
Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements.
Remarks:
By default this is set to zero, but depending on your units of measure and how close objects may be, it is advised to set this to something more realistic.
If the tolerance is positive, the point may lie up to the tolerance amount outside the outline to be matched.
If the tolerance is negative, the point must lie at least the tolerance amount inside the outline to be matched.
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.Point
The XYZ point to use when matching element bounding boxes.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Double,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
while specifying the tolerance to be used in deciding if the point matches the criteria.
This constructor includes the option to invert the filter and match all elements with a bounding box that do not contain the given point.
point:
The point used to find elements with a bounding box containing it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
inverted:
True if the filter should be inverted and match all elements with a bounding box that do not contain the given point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Double)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
while specifying the tolerance to be used in deciding if the point matches the criteria.
point:
The point used to find elements with a bounding box that contains it.
tolerance:
The tolerance value to use instead of zero. See the tolerance property for details.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for tolerance is not finite
-or-
The given value for tolerance is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ,System.Boolean)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point,
with the option to invert the filter and match all elements with a bounding box that do not contain the given point.
point:
The point used to find elements with a bounding box containing it.
inverted:
True if the filter should be inverted and match all elements with a bounding box that do not contain the given point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter.#ctor(Autodesk.Revit.DB.XYZ)
Constructs a new instance of a filter to match elements with a bounding box that contains the given point.
point:
The point used to find elements with a bounding box that contains it.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.BoundingBoxContainsPointFilter
A filter used to match elements with a bounding box that contains the given point.
Remarks:
This filter excludes all objects derived from View and objects derived from ElementType.
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2011